// 1 Задание
// Console.WriteLine("1 Задание");
// Console.Write("Введите число: ");
// string number1 = Console.ReadLine();
// int numberA = Convert.ToInt32(number1);
// Console.Write("Введите число: ");
// string number2 = Console.ReadLine();
// int numberB = Convert.ToInt32(number2);
// if(numberA >  numberB)
// {
//     Console.WriteLine("Число А больше числа В");
// }
// else
// {
//     Console.WriteLine("Число B больше числа A");
// }

// 2 Задание
// Console.WriteLine("2 Задание");

// Console.Write("Введите число: ");
// string number1 = Console.ReadLine();
// int numberA = Convert.ToInt32(number1);
// Console.Write("Введите число: ");
// string number2 = Console.ReadLine();
// int numberB = Convert.ToInt32(number2);
// Console.Write("Введите число: ");
// string number3 = Console.ReadLine();
// int numberC = Convert.ToInt32(number3);
// int max = numberA;
// if(numberA > numberB)
// {
//     if(numberA > numberC)
//     {
//         Console.WriteLine("А максимальное число");
//     }
//     else
//     {
//         Console.WriteLine("C максимальное число ");
//     }

// }
// else
// {
//     if(numberB > numberC)
//     {
//         Console.WriteLine("В максимальное число ");
//     }
//     else
//     {
//         Console.WriteLine("C максимальное число ");
//     }
// }

// // 3 Задание.
// Console.WriteLine("3 Задание");
// Console.Write("Введите число: ");
// string number1 = Console.ReadLine();
// int numberA = Convert.ToInt32(number1);
// if(numberA % 2 == 0)
// {
//     Console.Write("Число является четным");
// }
// else
// {
//     Console.Write("Число не является четным");
// }

// 4 Задание.
// Console.WriteLine("4 Задание");
// Console.Write("Введите число: ");
// string number1 = Console.ReadLine();
// int n = Convert.ToInt32(number1);
// Console.Write("Четные числа от 1 до {0}:", n);
// int i = 2;

// while(i <= n)
// {
//     Console.Write("{0} ", i);
//     i += 2;

// }


// Это как решил ChatGPT не понятно и сложно пока что

  // Console.Write("Введите число: ");
  //       int n = int.Parse(Console.ReadLine());

  //       Console.WriteLine("Четные числа от 1 до {0}:", n);

  //       int i = 2; // начинаем с 2 (первое четное число)
  //       while (i <= n) { // пока i не превысило заданное число n
  //           Console.Write("{0} ", i);
  //           i += 2; // увеличиваем i на 2 на каждой итерации
  //       }

  //       Console.ReadLine();
 
// using System;

// class Program {
//     static void Main(string[] args) {
//         Console.Write("Введите число: ");
//         int n = int.Parse(Console.ReadLine());

//         Console.WriteLine("Четные числа от 1 до {0}:", n);
//         for (int i = 2; i <= n; i += 2) {
//             Console.Write("{0} ", i);
//         }
//         Console.ReadLine();
//     }
// }
   
      
    
