// 1 Задание
Console.WriteLine("1 Задание")
Console.Write("Введите число: ");
string number1 = Console.ReadLine();
int numberA = Convert.ToInt32(number1);
Console.Write("Введите число: ");
string number2 = Console.ReadLine();
int numberB = Convert.ToInt32(number2);
if(numberA >  numberB)
{
    Console.WriteLine("Число А больше числа В");
}
else
{
    Console.WriteLine("Число B больше числа A");
}

// 2 Задание